<template>
  <div class="py-16">
    <h3>Испытательный центр ЦОТК АО «Каустик»</h3>
    <h5>Испытательный центр на договорной основе оказывает услуги по проведению сертификационных испытаний продукции, испытаний на подтверждения качества продукции на соответствие требованиям нормативной документации с выдачей протоколов испытаний. Протоколы испытаний испытательного центра являются необходимым основанием для выдачи сертификата соответствия.</h5>
    <p>Испытательный центр обеспечен в полном объёме всеми необходимыми нормативными документами (далее НД), регламентирующими требования к испытуемой продукции, методам испытаний анализируемых объектов. В своей деятельности испытательный центр использует нормативные документы, в том числе нормативные акты Государственной системы технического регулирования Республики Казахстан. Испытательный центр руководствуется действующими Законодательствами Республики Казахстан, организационными и методическими документами Комитета по техническому регулированию и метрологии Министерства индустрии и новых технологий Республики Казахстан.</p>
    <p>Штат испытательного центра укомплектован специалистами, имеющими соответствующее образование, профессиональную подготовку, квалификацию и опыт проведения испытаний.</p>
    <p>Испытательный центр оснащен в полном объеме для выполнения всех заявленных видов работ современными средствами измерений и испытательным оборудованием, которые своевременно проходят метрологическую аттестацию и поверки.</p>
    <p>Руководитель испытательного центра — Епифанцева Татьяна Михайловна.</p>
    <p>тел.:<a href="tel:+7 (7182) 399 459">+7 (7182) 399 459</a></p>
    <p>СТОИМОСТЬ услуг, оказываемых Испытательным центром ЦОТК АО «Каустик» (Аттестат аккредитации № КZ.И.14.1055 от 09.12.10 г.) <a href="../../assets/price2014.doc" download=""><v-icon class="ml-5" color="primary" large>mdi-download-circle-outline</v-icon></a> </p> 
  </div>
</template>