<template>
  <div>
    <v-card class="mb-10">
      <v-tabs vertical>
        <v-tab>
          <v-icon left color="green">
            mdi-leaf-maple
          </v-icon>
          Экологическая политика
        </v-tab>
        <v-tab>
          <v-icon left color="green">
            mdi-axis-y-arrow
          </v-icon>
          <div class="caption">Система экологического менеджмента</div>
        </v-tab>
        <v-tab>
          <v-icon left color="green">
            mdi-poll
          </v-icon>
          Анализ выбросов
        </v-tab>
        <v-tab-item>
          <v-card flat min-height="400px">
            <v-card-text>
              <h6>АО «Каустик» единственный отечественный производитель хлор-щелочной продукции, работающий на территории Республики Казахстан.</h6>

              <p>В производственном процессе используется самая современная из применяемых в мире технологий — мембранный электролиз. Данная технология обеспечивает не только оптимальные производственные показатели, но и гарантирует экологическую чистоту процесса. Отсутствие взаимодействия при основном технологическом процессе с окружающей средой позволяет достичь максимальной экологической эффективности производства.</p>

              <p>АО «Каустик» признает высокую ответственность перед обществом и будущими поколениями и работает по самым высоким экологическим стандартам.</p>

              <p>Экологическая политика АО «Каустик» основана на законодательных и иных нормативно-правовых актах Республики Казахстан, международных договорах Республики Казахстан в области охраны окружающей среды и рационального использования природных ресурсов.</p>

              <p>АО «Каустик» имеет все документы, необходимые для осуществления природопользования, согласованные и полученные в уполномоченных органах по экологии, а именно:</p>

              <ul>
                <li>разрешение на эмиссии в окружающую среду, полученное в 2009 году;</li>
                <li>прошедшие государственную экспертизу проекты ПДВ (предельно-допустимые выбросы), НРО (нормативы размещения отходов), ПДС (предельно-допустимые сбросы) в 2010 году.</li>
              </ul>
              
              <p>Политика в области ООС, охраны здоровья и обеспечения безопасности труда <a href="../../assets/Politika-v-oblasti-OOS,-ohrani-zdorovya-i-obespecheniya-bezopasnosti-truda.PDF" download=""><v-icon class="ml-5" color="green" large>mdi-download-circle-outline</v-icon></a> </p> 
                
            </v-card-text>
          </v-card>
        </v-tab-item> 
        <v-tab-item>
          <v-card>
            <v-card-text>
              <h6>Экологический менеджмент является одним из приоритетных направлений деятельности АО «Каустик». На предприятии постоянно ведется работа по мониторингу экологической обстановки.</h6>

              <p>В рамках системы управления экологической безопасностью АО «Каустик» реализует следующие мероприятия:</p>
              <ul>
                <li>обеспечение минимального объема выбросов загрязняющих веществ в окружающую среду;</li>
                <li>переработка и утилизация сточных вод;</li>
                <li>предотвращение чрезвычайных ситуаций, мероприятия по снижению риска аварийных ситуаций обеспечения необходимого уровня
                готовности сил и средств, для предотвращения и ликвидации последствий аварий и чрезвычайных ситуаций;</li>
                <li>повышение уровня знаний работников предприятия в области экологии.</li>      
              </ul>
              
              <p>В рамках проекта строительства и эксплуатации установки для производства хлора и каустической соды АО «Каустик» в октябре 2009 года провело публичные и общественные слушания по обсуждению материалов оценки воздействия на окружающую среду (ОВОС) нового Проекта с участием представителей Европейского Банка Реконструкции и Развития (ЕБРР) и компании «Environ» (Великобритания). Так же в слушаниях участвовали административные, экспертные, контролирующие, промышленные, учебные, научно-исследовательские и общественные организации, СМИ, жители г. Павлодар и с. Павлодарское. В результате проведенных общественных слушаний замечаний и возражений со стороны участников слушаний не поступило.</p>

              <p>2009–2010 гг. — Экологический аудит АО «Каустик» и Проекта ХЩП (хлор-щелочного производства) проведен компанией «Environ» (Великобритания).</p>

              <p>Выпускаемая продукция прошла процедуру подтверждения соответствия требованиям безопасности и качества технического регламента и ГОСТ 857-95, 6718-93.</p>

              <p>На предприятии ведутся работы по внедрению системы менеджмента качества в соответствии с международными стандартам ISO:9001, ISO:14001 и ISO:18001.</p>

              <h6>Мероприятия и цели по ООС</h6>
              <p>Совместно с ТОО «Восток Экология ПВ» проводится мониторинг по состоянию подземных вод и степени загрязнения сточных вод при антропогенном воздействии на них от деятельности предприятия и утвержден отчёт о результатах ведения мониторинга подземных вод по сети наблюдательных скважин АО «Каустик» за 2012–2015 г.г., также проведен мониторинг о степени опасности складируемых на полигоне отходов для подземных и поверхностных вод, почвенного покрова и атмосферного воздуха и утвержден отчёт оценка уровня загрязнения компонентов окружающей среды в районе расположения накопителя отходов  АО «Каустик».</p>

              <p>Для реализации предприятием политики и задач в области охраны труда и оценки его деятельности в этой области со сторонними организациями утверждена Система управления охраной окружающей среды АО «Каустик».</p>

              <p>29 октября 2015 года предприятием было получено Разрешение на эмиссии в окружающую среду на 2015–2019 г.г., выданное «Департаментом экологии по Павлодарской области» Комитета экологического регулирования, контроля и государственной инспекции в нефтегазовом комплексе Министерства энергетики РК.</p>

              <p>АО «Каустик» 15.12.2015 г. получило Разрешение на специальное водопользование — сброс производственных, коммунально-бытовых и промливневых сточных вод в накопитель Былкылдак, выданное Министерством сельского хозяйства РК Комитета по водным ресурсам ГУ Ертисская бассейновая инспекция по регулирования использования и охране водных ресурсов.</p>

              <p>Мероприятия по охране окружающей среды выполняются согласно «Плана мероприятий по охране окружающей среды АО «Каустик» на 2015–2019 г.г.». Предприятие осуществляет свою деятельность согласно производственно-нормативных и правовых документов, относящихся к охране окружающей среды.</p>

              <p>Цели АО «Каустик» на 2016 год по улучшению работы в сфере безопасности и охраны труда, промышленной безопасности и охраны окружающей среды</p>

              <ol>
                <li>проводить регулярную инвентаризацию и мониторинг источников загрязняющих веществ.</li>
                <li>минимизировать технологические потери.</li>
                <li>не допускать сброс загрязненных сточных вод в водные объекты сверх лимита;</li>
                <li>вести постоянный мониторинг сточных, вод в целях обеспечения контроля и снижения уровня их загрязнения. 
                сокращение образования отходов и возможность их утилизации.</li>
              </ol>
              
              
              <p>Разрешение на эмиссии в ОС-2015-2019 г.г.<a href="../../assets/Razreshenie-na-emissii-v-OS-2015-2019-g.g..pdf" download=""><v-icon class="ml-5" color="green" large>mdi-download-circle-outline</v-icon></a> </p> 
              
            </v-card-text>
          </v-card>
        </v-tab-item>
        <v-tab-item>
          <v-card>
            <v-card-text>
              <h6>Система сбора и обработки информации базируется на аналитических измерениях, проводимых согласно Программе производственного экологического контроля (ПЭК, Программа).</h6>

              <p>Порядок организации ПЭК регулируется положениями, утверждаемыми самим предприятием. ПЭК осуществляется экологической службой предприятия. Все сведения об организации ПЭК АО «Каустик» представляет в органы исполнительной власти, осуществляющие государственный экологический контроль. Отчетность предприятия базируется на данных ПЭК.</p>

              <p>К обязательным формам отчетности на территории Республики Казахстан относятся:</p>

              <h6>Экологическая статистическая отчетность:</h6>
              <ul>
                <li>отчет о текущих затратах на охрану окружающей среды, экологических платежах и плате за природные ресурсы (индекс 4-ОС);</li>
                <li>отчет о сборе и вывозе коммунальных отходов (индекс 1-отходы);</li>
                <li>отчет о сортировке и депонировании отходов (индекс 2-отходы);</li>
                <li>отчет об охране атмосферного воздуха (индекс 2-ТП (воздух));</li>
              </ul>

              <h6>Экологическая отчетность в уполномоченные органы о выполнении условий природопользования:</h6>
              <ul>
                <li>отчет по Программе (плану) мероприятий по охране окружающей среды;</li>
                <li>отчет по Программе экологического контроля;</li>
                <li>отчет по опасным отходам;</li>
                <li>плата за эмиссии в окружающую среду;</li>
                <li>отчет по разрешенным и фактическим эмиссиям.</li>
              </ul>
              <p>АО «Каустик» осуществляет регулярный мониторинг окружающей среды, под которым понимается комплексная система наблюдения за состоянием окружающей среды, оценки и прогноза изменений состояния окружающей среды под воздействием природных и антропогенных факторов. Экологический мониторинг включает в себя мониторинг атмосферного воздуха, водных объектов, почв. Мониторинг объектов окружающей среды осуществляется силами собственной лаборатории, прошедшей аттестацию и аккредитацию.</p>

              <h6>Цели проведения экологического мониторинга:</h6>
              <ul>
                <li>наблюдение за состоянием окружающей среды, в том числе за состоянием окружающей среды в районах расположения источников антропогенного воздействия и воздействием этих источников на окружающую среду;</li>
                <li>оценка и прогноз изменений состояния окружающей среды под воздействием природных и антропогенных факторов;</li>
                <li>обеспечение потребностей государства, юридических и физических лиц в достоверной информации о состоянии окружающей среды и ее изменениях, необходимой для предотвращения и (или) уменьшения неблагоприятных последствий таких изменений.</li>
              </ul>
              <p>По результатам экологического мониторинга за 2015г. и 9 месяцев 2016г. и сравнительного анализа за вышеуказанный период превышения установленных предельно-допустимых норм по выбросам и сбросам не зафиксировано и не выявлено.</p>
            </v-card-text>
          </v-card>
        </v-tab-item>
      </v-tabs>    
    </v-card>
  </div>
</template>

<script>
  export default {
    data: () => ({
      
    }),
  }
</script>

<style>
.v-tab{
  justify-content: start;
}
</style>