<template>
  <div>
    <v-card class="mb-10">
      <v-tabs>
        <v-tab>
          <v-icon left color="primary">
            mdi-account-sync
          </v-icon>
          Кадровая политика
        </v-tab>
        <v-tab>
          <v-icon left color="primary">
            mdi-account-group
          </v-icon>
          Социальные программы
        </v-tab>

        <v-tab-item>
          <v-card flat min-height="400px">
            <v-card-text>
            <h5>
            Кадровая политика АО «Каустик» направлена на формирование сплоченного, высокопрофессионального коллектива, способного выполнять сложнейшие задачи и способствующий росту и процветания как самой компании, так и Республики Казахстан.
            </h5>
            <p>Компания проводит активную политику по привлечению молодых специалистов – выпускников профильных высших учебных заведений. Кроме того, АО «Каустик» активно привлекает специалистов из смежных отраслей промышленности. </p>
            

            <p>Обновляя и омолаживая кадровый состав, АО «Каустик» уделяет особое внимание передаче знаний и трудовых традиций, накопленных еще со времен существования Павлодарского химического завода.</p> 

            <h6>
              Опираясь на наше прошлое, мы живем в настоящем и уверенно смотрим в наше будущее.
            </h6>
            </v-card-text>
          </v-card>
        </v-tab-item>
        <v-tab-item>
          <v-card flat min-height="400px">
            <v-card-text>
              <h6>Одним из приоритетных направлений деятельности АО «Каустик» является социальное обеспечение сотрудников завода.</h6>

              <p>Основные направления социальной политики АО «Каустик» включают:</p>

              <li>обеспечение социальных гарантий сотрудникам через коллективный договор;</li>
              <li>обеспечение достойного уровня жизни сотрудников через гарантированно высокий уровень оплаты труда;</li>
              <li>обеспечение возможности повышения квалификации сотрудников;</li>
              <li>организация спортивной и культурно-досуговой деятельности на заводе;</li>
              <li>проведение культурно-массовых мероприятий и пр.</li>
              

              <p>АО «Каустик» подписан коллективный трудовой договор, фиксирующий обязательства работодателя перед работниками завода: режим работы, гарантированное время отдыха, компенсационные выплаты, права и обязанности сторон.</p>

              <p>В настоящее время Компания предлагает своим сотрудникам конкурентный уровень заработной платы в регионе, выплачивает премии и надбавки, а также компенсирует расходы сотрудников на санаторно-профилакторное лечение.</p>

              <p>АО «Каустик» регулярно проводит обучение своих специалистов профильным знаниям, отправляет работников на курсы повышения квалификации, проводит обучение собственными силами.</p>

              <p>Профессиональный союз АО «Каустик» организует участие в спортивно-оздоровительных мероприятиях (участие в региональных соревнованиях профсоюзов по дисциплинам футбол, волейбол, кроссы и пр.).</p>

              <p>Компания организует и проводит празднование Дня химика, Дня Победы, Дня города и прочих праздников.</p>
            </v-card-text>
          </v-card>
        </v-tab-item>
      </v-tabs>
    </v-card>
  </div>
</template>